steck_kazan_fio_test1.txt
random-read: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.2.10
Starting 2 processes

random-read: (groupid=0, jobs=1): err= 0: pid=3279: Tue Nov 28 11:43:11 2017
  read : io=131072KB, bw=1558.8KB/s, iops=389, runt= 84088msec
    clat (usec): min=195, max=559858, avg=2562.17, stdev=7822.73
     lat (usec): min=195, max=559859, avg=2562.43, stdev=7822.75
    clat percentiles (usec):
     |  1.00th=[  227],  5.00th=[  258], 10.00th=[  434], 20.00th=[  540],
     | 30.00th=[  572], 40.00th=[  604], 50.00th=[  644], 60.00th=[  700],
     | 70.00th=[  868], 80.00th=[ 3216], 90.00th=[ 7648], 95.00th=[10432],
     | 99.00th=[22656], 99.50th=[32128], 99.90th=[54528], 99.95th=[96768],
     | 99.99th=[317440]
    bw (KB  /s): min=    7, max= 4752, per=100.00%, avg=1569.73, stdev=1138.14
    lat (usec) : 250=3.77%, 500=8.26%, 750=53.04%, 1000=6.94%
    lat (msec) : 2=4.75%, 4=5.01%, 10=12.56%, 20=4.42%, 50=1.12%
    lat (msec) : 100=0.08%, 250=0.02%, 500=0.02%, 750=0.01%
  cpu          : usr=0.27%, sys=1.18%, ctx=32798, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write: (groupid=0, jobs=1): err= 0: pid=3280: Tue Nov 28 11:43:11 2017
  write: io=131072KB, bw=1132.8MB/s, iops=289982, runt=   113msec
    clat (usec): min=1, max=147, avg= 2.50, stdev= 1.91
     lat (usec): min=2, max=151, avg= 2.60, stdev= 2.10
    clat percentiles (usec):
     |  1.00th=[    2],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    3], 95.00th=[    4],
     | 99.00th=[    5], 99.50th=[    7], 99.90th=[   29], 99.95th=[   35],
     | 99.99th=[   50]
    lat (usec) : 2=0.08%, 4=91.77%, 10=7.71%, 20=0.18%, 50=0.24%
    lat (usec) : 100=0.01%, 250=0.01%
  cpu          : usr=35.71%, sys=60.71%, ctx=9, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=32768/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=131072KB, aggrb=1558KB/s, minb=1558KB/s, maxb=1558KB/s, mint=84088msec, maxt=84088msec
  WRITE: io=131072KB, aggrb=1132.8MB/s, minb=1132.8MB/s, maxb=1132.8MB/s, mint=113msec, maxt=113msec

Disk stats (read/write):
    dm-0: ios=32631/156, merge=0/0, ticks=83024/162196, in_queue=245232, util=98.86%, aggrios=32768/272, aggrmerge=0/12, aggrticks=83116/313704, aggrin_queue=396800, aggrutil=98.74%
  sda: ios=32768/272, merge=0/12, ticks=83116/313704, in_queue=396800, util=98.74%