steck_kazan_fio_test2.txt
random-read: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.2.10
Starting 2 processes
random-read: Laying out IO file(s) (1 file(s) / 128MB)
random-write: Laying out IO file(s) (1 file(s) / 128MB)

random-read: (groupid=0, jobs=1): err= 0: pid=1687: Tue Nov 28 12:36:28 2017
  read : io=131072KB, bw=3238.1KB/s, iops=809, runt= 40468msec
    clat (usec): min=184, max=67905, avg=1231.28, stdev=2566.38
     lat (usec): min=184, max=67906, avg=1231.53, stdev=2566.39
    clat percentiles (usec):
     |  1.00th=[  211],  5.00th=[  235], 10.00th=[  266], 20.00th=[  494],
     | 30.00th=[  516], 40.00th=[  540], 50.00th=[  564], 60.00th=[  596],
     | 70.00th=[  652], 80.00th=[  716], 90.00th=[ 2256], 95.00th=[ 6048],
     | 99.00th=[11840], 99.50th=[15424], 99.90th=[28032], 99.95th=[34048],
     | 99.99th=[54016]
    bw (KB  /s): min=  318, max= 8677, per=100.00%, avg=3250.33, stdev=1865.51
    lat (usec) : 250=7.64%, 500=14.39%, 750=60.05%, 1000=4.26%
    lat (msec) : 2=3.14%, 4=3.09%, 10=5.85%, 20=1.35%, 50=0.21%
    lat (msec) : 100=0.02%
  cpu          : usr=0.44%, sys=2.28%, ctx=32822, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write: (groupid=0, jobs=1): err= 0: pid=1688: Tue Nov 28 12:36:28 2017
  write: io=131072KB, bw=929589KB/s, iops=232397, runt=   141msec
    clat (usec): min=1, max=138, avg= 3.16, stdev= 4.82
     lat (usec): min=2, max=138, avg= 3.28, stdev= 4.94
    clat percentiles (usec):
     |  1.00th=[    2],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[   18], 99.50th=[   40], 99.90th=[   62], 99.95th=[   73],
     | 99.99th=[  120]
    lat (usec) : 2=0.06%, 4=80.71%, 10=17.33%, 20=0.91%, 50=0.60%
    lat (usec) : 100=0.37%, 250=0.02%
  cpu          : usr=25.71%, sys=65.71%, ctx=423, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=32768/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=131072KB, aggrb=3238KB/s, minb=3238KB/s, maxb=3238KB/s, mint=40468msec, maxt=40468msec
  WRITE: io=131072KB, aggrb=929588KB/s, minb=929588KB/s, maxb=929588KB/s, mint=141msec, maxt=141msec

Disk stats (read/write):
    dm-0: ios=32663/161, merge=0/0, ticks=39268/18692, in_queue=57976, util=97.45%, aggrios=32768/272, aggrmerge=0/17, aggrticks=39420/34088, aggrin_queue=73500, aggrutil=97.18%
  sda: ios=32768/272, merge=0/17, ticks=39420/34088, in_queue=73500, util=97.18%