steck_kazan_fio_test3.txt
random-read: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
random-write: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.2.10
Starting 2 processes
random-read: Laying out IO file(s) (1 file(s) / 128MB)
random-write: Laying out IO file(s) (1 file(s) / 128MB)

random-read: (groupid=0, jobs=1): err= 0: pid=1881: Tue Nov 28 13:04:40 2017
  read : io=131072KB, bw=2591.9KB/s, iops=647, runt= 50572msec
    clat (usec): min=190, max=152961, avg=1539.55, stdev=3066.96
     lat (usec): min=191, max=152962, avg=1539.81, stdev=3066.98
    clat percentiles (usec):
     |  1.00th=[  215],  5.00th=[  235], 10.00th=[  258], 20.00th=[  494],
     | 30.00th=[  548], 40.00th=[  588], 50.00th=[  620], 60.00th=[  676],
     | 70.00th=[  740], 80.00th=[ 1160], 90.00th=[ 4048], 95.00th=[ 7328],
     | 99.00th=[13376], 99.50th=[16768], 99.90th=[31872], 99.95th=[37120],
     | 99.99th=[48384]
    bw (KB  /s): min=  430, max=11376, per=99.76%, avg=2584.88, stdev=1746.73
    lat (usec) : 250=8.23%, 500=13.13%, 750=49.39%, 1000=7.40%
    lat (msec) : 2=6.60%, 4=5.08%, 10=7.72%, 20=2.20%, 50=0.24%
    lat (msec) : 100=0.01%, 250=0.01%
  cpu          : usr=0.36%, sys=1.76%, ctx=32835, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32768/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
random-write: (groupid=0, jobs=1): err= 0: pid=1882: Tue Nov 28 13:04:40 2017
  write: io=131072KB, bw=1163.7MB/s, iops=297890, runt=   110msec
    clat (usec): min=1, max=135, avg= 2.47, stdev= 1.83
     lat (usec): min=2, max=135, avg= 2.57, stdev= 1.87
    clat percentiles (usec):
     |  1.00th=[    2],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    3], 90.00th=[    3], 95.00th=[    4],
     | 99.00th=[    6], 99.50th=[   11], 99.90th=[   31], 99.95th=[   37],
     | 99.99th=[   62]
    lat (usec) : 2=0.03%, 4=93.71%, 10=5.54%, 20=0.58%, 50=0.12%
    lat (usec) : 100=0.02%, 250=0.01%
  cpu          : usr=18.35%, sys=80.73%, ctx=60, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=32768/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=131072KB, aggrb=2591KB/s, minb=2591KB/s, maxb=2591KB/s, mint=50572msec, maxt=50572msec
  WRITE: io=131072KB, aggrb=1163.7MB/s, minb=1163.7MB/s, maxb=1163.7MB/s, mint=110msec, maxt=110msec

Disk stats (read/write):
    dm-0: ios=32738/159, merge=0/0, ticks=49648/16232, in_queue=65892, util=98.18%, aggrios=32769/272, aggrmerge=0/15, aggrticks=49648/31516, aggrin_queue=81160, aggrutil=98.03%
  sda: ios=32769/272, merge=0/15, ticks=49648/31516, in_queue=81160, util=98.03%